[
    {
        "text": "Just saw a LinkedIn Influencer with 'Organic Growth' in the profile with 65K+ followers claiming he can help you grow your platform, copying posts from other influencers.",
        "engagement": 90,
        "line_count": 4,
        "language": "Hinglish",
        "tags": [
            "Growth"
        ]
    },
    {
        "text": "Jobseekers, this one’s for you. Every application, every interview, every follow-up… the pressure is immense. It's not about you or your skills, it's about a broken system where 60% of applicants never hear back. Your mental health is the real priority. Take care of yourself and breathe.",
        "engagement": 347,
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Job Search",
            "Mental Health"
        ]
    },
    {
        "text": "Looking for jobs on LinkedIn is like online dating: Full of promises, but in the end, you’re just left ghosted.",
        "engagement": 109,
        "line_count": 2,
        "language": "Hinglish",
        "tags": [
            "Online Dating",
            "Ghosting"
        ]
    },
    {
        "text": "LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t apply for!' Pay Rs. 50,000 for the honor.",
        "engagement": 115,
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Scams",
            "LinkedIn"
        ]
    },
    {
        "text": "Sapne dekhna achi baat hai, lekin job ka sapna dekh ke 'interested' likhna, yeh toh achi baat nahi hai na?",
        "engagement": 545,
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Job Search",
            "Dreams"
        ]
    },
    {
        "text": "Next time when I read a LinkedIn Influencer's story, I start from the last line. If there's a link, it's most probably fake. Saves time!",
        "engagement": 188,
        "line_count": 2,
        "language": "Hinglish",
        "tags": [
            "LinkedIn",
            "Influencer"
        ]
    },
    {
        "text": "Every time I poured my heart into interviews and faced rejection, it felt like a punch. But looking back, it wasn’t nothing. The Universe shows why rejection happened. Doors I thought I wanted to walk through were shut, only for the right ones to open. Trust the process.",
        "engagement": 206,
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Interviews",
            "Rejection"
        ]
    },
    {
        "text": "To everyone still looking for a job: You're not alone. Every rejection feels like a punch, but this doesn’t define you. Take breaks, breathe, and remember your worth. Your mental health matters more than any job.",
        "engagement": 899,
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Mental Health",
            "Job"
        ]
    },
    {
        "text": "Sometimes, a company's brand name doesn’t define talent. People from smaller companies blow me away with their skills. Happiness and growth come from doing what you love and improving your craft, not brand size.",
        "engagement": 166,
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Talent",
            "Growth"
        ]
    },
    {
        "text": "When I left a toxic work environment, I told my manager a simple thing and felt good. Treating others well matters. Bring small changes and break the chain.",
        "engagement": 1111,
        "line_count": 5,
        "language": "Hinglish",
        "tags": [
            "Manners",
            "Toxic Work Environment"
        ]
    }
]